---
kind: property
id: P:Autodesk.Revit.DB.Electrical.CorrectionFactorSet.IsEmpty
source: html/33a033ef-a203-11b1-004c-7a5649768fba.htm
---
# Autodesk.Revit.DB.Electrical.CorrectionFactorSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.